# Konversi nilai numerik ke dalam kategori pada Data Frame

## Import Modules

In [3]:
import pandas as pd
import numpy as np

print("Pandas version:", pd.__version__,
      "\nNumPy version:", np.__version__)

Pandas version: 2.2.3
NumPy version: 2.1.3

## Persiapan Data Frame

In [8]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), columns=cols)

df

   usia
0    87
1    76
2    86
3    35
4    50
5     9
6    46
7    26
8    38
9    15

## Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [9]:
df['kelompok_usia'] = pd.cut(df['usia'],
                            bins = [0, 18, 65, 99],
                            labels = ['anak', 'dewasa', 'manula'])

df

   usia kelompok_usia
0    87        manula
1    76        manula
2    86        manula
3    35        dewasa
4    50        dewasa
5     9          anak
6    46        dewasa
7    26        dewasa
8    38        dewasa
9    15          anak

In [11]:
# Mengurutkan DataFrame berdasarkan kolom 'usia'
df = df.sort_values(by='usia')
df

   usia kelompok_usia
5     9          anak
9    15          anak
7    26        dewasa
3    35        dewasa
8    38        dewasa
6    46        dewasa
4    50        dewasa
1    76        manula
2    86        manula
0    87        manula